- **Melt**
- **Stack and unstack**
- **Pivot**

### Melt

**melt()** function is useful to message a DataFrame into a format where one or more columns are identifier variables, while all other columns, considered measured variables, are unpivoted to the row axis, leaving just two non-identifier columns, variable and value. 

Syntax : 
 
pandas.melt(frame, id_vars=None, value_vars=None,var_name=None, value_name='value', col_level=None)

Frame : DataFrame 
- id_vars[tuple, list, or ndarray, optional] : Column(s) to use as identifier variables. 

- value_vars[tuple, list, or ndarray, optional]: Column(s) to unpivot. If not specified, uses all columns that are not set as id_vars. 
- var_name[scalar]: Name to use for the ‘variable’ column. If None it uses frame.columns.name or ‘variable’. 
- value_name[scalar, default ‘value’]: Name to use for the ‘value’ column. 
- col_level[int or string, optional]: If columns are a MultiIndex then use this level to melt.

In [1]:
import pandas as pd

In [2]:
# importing pandas as pd
import pandas as pd
 
# creating a dataframe
df = pd.DataFrame({'Name': {0: 'John', 1: 'Bob', 2: 'Shiela'},
                   'Course': {0: 'Masters', 1: 'Graduate', 2: 'Graduate'},
                   'Age': {0: 27, 1: 23, 2: 21}})
df

     Name    Course  Age
0    John   Masters   27
1     Bob  Graduate   23
2  Shiela  Graduate   21

In [3]:
# Name is id_vars and Course is value_vars
pd.melt(df, id_vars =['Name'], value_vars =['Course'])

     Name variable     value
0    John   Course   Masters
1     Bob   Course  Graduate
2  Shiela   Course  Graduate

In [4]:
# multiple unpivot columns
pd.melt(df, id_vars =['Name'], value_vars =['Course', 'Age'])

     Name variable     value
0    John   Course   Masters
1     Bob   Course  Graduate
2  Shiela   Course  Graduate
3    John      Age        27
4     Bob      Age        23
5  Shiela      Age        21

In [6]:
# Names of ‘variable’ and ‘value’ columns can be customized
pd.melt(df, id_vars =['Name'], value_vars =['Course'],
              var_name ='ChangedVarname', value_name ='ChangedValname')

     Name ChangedVarname ChangedValname
0    John         Course        Masters
1     Bob         Course       Graduate
2  Shiela         Course       Graduate

### Stack and unstack

In [ ]:
# reshape the dataframe using stack() method
df_stacked = df.stack()

In [9]:
df_stacked

0  Name          John
   Course     Masters
   Age             27
1  Name           Bob
   Course    Graduate
   Age             23
2  Name        Shiela
   Course    Graduate
   Age             21
dtype: object

In [14]:
df_stacked2 = df.stack().to_frame()
df_stacked2

                 0
0 Name        John
  Course   Masters
  Age           27
1 Name         Bob
  Course  Graduate
  Age           23
2 Name      Shiela
  Course  Graduate
  Age           21

In [15]:
df_stacked.index.levels

FrozenList([[0, 1, 2], ['Name', 'Course', 'Age']])

In [10]:
df

     Name    Course  Age
0    John   Masters   27
1     Bob  Graduate   23
2  Shiela  Graduate   21

In [11]:
df_unstacked = df_stacked.unstack()

In [13]:
df_unstacked

     Name    Course Age
0    John   Masters  27
1     Bob  Graduate  23
2  Shiela  Graduate  21

### pivot

In [19]:
df_pivot = df.pivot(index='Name',columns="Age")

In [20]:
df_pivot

          Course
Age           21        23       27
Name
Bob          NaN  Graduate      NaN
John         NaN       NaN  Masters
Shiela  Graduate       NaN      NaN

In [23]:
df_pivot = df.pivot(index='Name',columns="Age",values='Age')
df_pivot

Age       21    23    27
Name
Bob      NaN  23.0   NaN
John     NaN   NaN  27.0
Shiela  21.0   NaN   NaN